
RECLASSIFY_TYPE_CODE_DICT = {
    '删除':                    0,
    '居住用地':               101,
    '公共管理与公共服务用地':  201,
    '教育与科研用地':         202,
    '医疗卫生用地':           203,
    '商业服务用地':           301,
    '工矿用地':               401,
    '交通运输用地':           501,
    '绿地与开敞空间用地':      601
}

POI_TYPE_CODE = {
    '居住用地':               0,
    '公共管理与公共服务用地':  1,
    '教育与科研用地':         2,
    '医疗卫生用地':           3,
    '商业服务用地':           4,
    '工矿用地':               4,
    '交通运输用地':           4,
    '绿地与开敞空间用地':     5
}


LU_TYPE_CODE = {
    '101': 0,
    '201': 4,
    '202': 4,
    '301': 4,
    '401': 4,
    '402': 4,
    '403': 4,
    '501': 1,
    '502': 2,
    '503': 3,
    '504': 1,
    '505': 5,
}
